#pragma once

// Deep Rock Galactic (0.22) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "DRG_FSD_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class FSD.Objective
// 0x0078 (0x0168 - 0x00F0)
class UObjective : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnObjectiveUpdated;                                       // 0x00F0(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0100(0x0008) MISSED OFFSET
	class UClass*                                      WidgetClass;                                              // 0x0108(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FMissionShouts                              MissionShouts;                                            // 0x0110(0x0020) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FText                                       MissionDescription;                                       // 0x0130(0x0018) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly)
	int                                                CompletionRewardInCredits;                                // 0x0148(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                CompletionRewardInXP;                                     // 0x014C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               ScaleObjectiveToMission;                                  // 0x0150(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0151(0x0007) MISSED OFFSET
	class UMissionStat*                                ObjectiveCompletedStat;                                   // 0x0158(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                IsPrimaryObjective;                                       // 0x0160(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	float                                              MissionScale;                                             // 0x0164(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.Objective");
		return ptr;
	}


	void OnRep_IsPrimaryObjective();
	bool IsTutorialObjective();
	bool IsPrimary();
	bool IsCompleted();
	bool HasReplicated();
	int GetRewardXP();
	struct FCreditsReward GetRewardCredits();
	struct FText GetObjectiveText();
	static class UTexture2D* GetObjectiveIconFromClass(class UClass* objectiveClass);
	class UTexture2D* GetObjectiveIcon();
	static struct FText GetObjectiveDescriptionFromClass(class UClass* objectiveClass, float missionLength);
	struct FText GetObjectiveDescription(float missionLength);
	static int GetObjectiveAmountFromClass(class UClass* objectiveClass, float missionLength);
	int GetObjectiveAmount(float missionLength);
	struct FText GetInMissionText();
};


// Class FSD.ActivationOjective
// 0x0008 (0x0170 - 0x0168)
class UActivationOjective : public UObjective
{
public:
	int                                                ObjectivesFound;                                          // 0x0168(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	int                                                ObjectivesToFind;                                         // 0x016C(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.ActivationOjective");
		return ptr;
	}


	void OnRep_ObjectivesToFind(int prevAmount);
	void OnRep_ObjectivesFound(int prevAmount);
	void OnPlayerJoined(class APlayerCharacter* PlayerCharacter);
};


// Class FSD.ActivationObject
// 0x0010 (0x0338 - 0x0328)
class AActivationObject : public AActor
{
public:
	class USingleUsableComponent*                      Usable;                                                   // 0x0328(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	bool                                               HasBeenUsed;                                              // 0x0330(0x0001) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0331(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.ActivationObject");
		return ptr;
	}


	void OnUsedBy(class APlayerCharacter* user);
};


// Class FSD.ActorFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UActorFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.ActorFunctionLibrary");
		return ptr;
	}


	static void UnlockSpecificCharacters(class UObject* WorldContextObject, TArray<class APlayerCharacter*> Characters, ECharacterState UnlockIf, ECharacterState UnlockTo);
	static void UnlockCharacters(class UObject* WorldContextObject);
	static float TimeSince(class UObject* WorldContextObject, float Time);
	static void PlayCueOnClient(class APlayerController* Target, class USoundCue* cue);
	static void PlayCueOnAll(class UObject* WorldContextObject, class USoundCue* cue);
	static float PingPong(float Time, float Length, bool normalize);
	static float MoveTowards(float current, float End, float step);
	static void LockSpecificCharactersIfState(class UObject* WorldContextObject, TArray<class APlayerCharacter*> Characters, ECharacterState stateToLock);
	static void LockSpecificCharacters(class UObject* WorldContextObject, TArray<class APlayerCharacter*> Characters);
	static bool LockSpecificCharacterIfState(class UObject* WorldContextObject, class APlayerCharacter* Character, ECharacterState LockIf, ECharacterState LockTo);
	static void LockCharacters(class UObject* WorldContextObject);
	static class UClass* LoadWindowWidgetClass(TSoftObjectPtr<class UClass> WidgetClass);
	static class UClass* LoadWidgetClass(TSoftObjectPtr<class UClass> WidgetClass);
	static class UClass* LoadClass(TSoftObjectPtr<class UClass> softReference);
	static void KillActorWithEffects(class AActor* Actor, class USceneComponent* visualsToHide, class USoundCue* deathSound, class UParticleSystem* deathParticles, class UPathfinderCollisionComponent* pathColliderToDisable);
	static bool IsWeakPoint(class UFSDPhysicalMaterial* Material);
	static bool IsInRangeOfLocalPlayer(class AActor* toActor, float MinDistance, float MaxDistance);
	static bool IsCloseToLocalPlayer(class AActor* toActor, float distance);
	static float GetHeroXP(class UObject* WorldContextObject, class UClass* HeroClass);
	static struct FString GetHeroSourceName(class UClass* playerClass);
	static float GetHeroProgress(class UObject* WorldContextObject, class UClass* CharacterClass);
	static struct FText GetHeroName(class UClass* playerClass);
	static int GetHeroLevel(class UObject* WorldContextObject, class UClass* CharacterClass);
	static class UInventoryList* GetHeroInventoryList(class UPlayerCharacterID* characterID);
	static struct FHeroInfo GetHeroInfo(class UClass* playerClass);
	static class UTexture2D* GetHeroImageSmall(class UClass* playerClass);
	static class UTexture2D* GetHeroImageFullSize(class UClass* playerClass);
	static class UTexture2D* GetHeroImage(class UClass* playerClass);
	static struct FLinearColor GetHeroColor(class UClass* playerClass);
	static class UActorComponent* GetComponentFromClass(class UClass* Actor, class UClass* ComponentClass);
	static class UActorComponent* GetComponentByClass(class AActor* Actor, class UClass* ComponentClass);
	static class UPlayerCharacterID* GetCharacterID(class UClass* playerClass);
	static TArray<class APlayerCharacter*> GetAllPlayerCharacters(class UObject* WorldContext);
	static struct FVector GetActorTargetCenter(class AActor* targetActor);
	static void FSDRemoveBlendable(class UPostProcessComponent* PostProcessComponent, const TScriptInterface<class UBlendableInterface>& InBlendableObject);
	static void FSDRemoveAllWidgets(class UObject* WorldContextObject);
	static void FSDDumpCallStack(const struct FString& Msg);
	static class APlayerCharacter* FindNearestPlayerCharacter(class UObject* WorldContextObject, const struct FVector& fromLocation, float MaxRadius, bool MustBeAlive, bool MustBeUnparalyzed, bool MustHaveLineOfSight);
	static class AActor* FindClosestEnemyFromLocation(const struct FVector& fromLocation, float Range, bool LineOfSightCheck, class UObject* WorldContextObject, const struct FVector& Offset);
	static class AActor* FindClosestEnemyFromActor(class AActor* FromActor, float Range, bool LineOfSightCheck, const struct FVector& Offset);
	static float EvaluateRuntimeCurve(class UObject* WorldContextObject, const struct FRuntimeFloatCurve& Curve, float Time);
	static void DamagePlayersInArea(const struct FVector& Origin, class AActor* instigator, float Damage, float Radius, class UDamageClass* DamageClass);
	static class UHealthComponentBase* DamageIfInRange(float MaxDistance, float Damage, class AActor* Target, class AActor* Attacker, class UDamageClass* DamageClass);
	static void DamageAllInAreaExcept(const struct FVector& Origin, class AActor* instigator, float Damage, float blastRadius, float maxDamageRadius, float minDamagePercent, TArray<class AActor*> ignoreActors, float friendlyFireModifier, class UDamageClass* DamageClass);
	static void DamageAllInArea(const struct FVector& Origin, class AActor* instigator, float Damage, float blastRadius, float maxDamageRadius, float minDamagePercent, float friendlyFireModifier, class UDamageClass* DamageClass);
	static float AddHeroXP(class UObject* WorldContextObject, class UClass* HeroClass, float Amount);
};


// Class FSD.StatusEffectsFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UStatusEffectsFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.StatusEffectsFunctionLibrary");
		return ptr;
	}


	static float GetMaxResistance(class UClass* StatusEffect);
	static class UDamageClass* GetDamageClass(class UClass* StatusEffect);
	static bool CanTrigger(class UClass* StatusEffect, class AActor* OtherActor);
};


// Class FSD.FrontendBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UFrontendBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.FrontendBlueprintLibrary");
		return ptr;
	}


	static void OpenURLInExternalBrowser(const struct FString& URL);
	static EFSDTargetPlatform FSDTargetPlatform();
};


// Class FSD.GameModeFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UGameModeFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.GameModeFunctionLibrary");
		return ptr;
	}


	static struct FTransform FindRandomEscapePodLocation(class UObject* WorldContextObject);
	static struct FTransform FindEscapePodLocationAtDistance(class UObject* WorldContextObject, float distance, float aboveDistanceBias);
};


// Class FSD.FSDConversionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFSDConversionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.FSDConversionLibrary");
		return ptr;
	}


	static struct FVector_NetQuantizeNormal VectorToNetQuantizeNormal(const struct FVector& Vec);
	static struct FVector_NetQuantize VectorToNetQuantize(const struct FVector& Vec);
	static struct FVector QuatToVector(const struct FQuat& Quat);
	static struct FRotator QuatToRotator(const struct FQuat& Quat);
	static struct FVector_NetQuantizeNormal QuadToNetQuantizeNormal(const struct FQuat& Quat);
	static struct FVector ComponentToWorldLocation(class USceneComponent* Component);
	static struct FVector ActorToWorldLocation(class AActor* Actor);
};


// Class FSD.ActorStateComponent
// 0x0050 (0x0140 - 0x00F0)
class UActorStateComponent : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnBeginState;                                             // 0x00F0(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnTickState;                                              // 0x0100(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnEndState;                                               // 0x0110(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	class UActorStateComponent*                        CurrentState;                                             // 0x0120(0x0008) (CPF_ExportObject, CPF_Net, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	class UActorStateComponent*                        NextState;                                                // 0x0128(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	class UActorStateComponent*                        MasterState;                                              // 0x0130(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	float                                              StateActiveTime;                                          // 0x0138(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x013C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.ActorStateComponent");
		return ptr;
	}


	void OnRep_CurrentState(class UActorStateComponent* PreviousState);
	bool IsStateActive();
	void GotoState();
};


// Class FSD.FSDUserWidget
// 0x0020 (0x0228 - 0x0208)
class UFSDUserWidget : public UUserWidget
{
public:
	struct FScriptMulticastDelegate                    OnVisibilityChanged;                                      // 0x0208(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0218(0x0008) MISSED OFFSET
	class APlayerCharacter*                            Character;                                                // 0x0220(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.FSDUserWidget");
		return ptr;
	}


	static void SetTickEnabled(class UUserWidget* Widget, bool tickEnabled);
	void SetOpacity(float Alpha);
	void ScaleByBaseResolution();
	void Refresh();
	void ReceiveNewVisibility(ESlateVisibility NewVisibility);
	void OnCloseMenuReleased(bool* Handled);
	void OnCloseMenuPressed(bool* Handled);
	bool HasCharacter();
	float GetOpacity();
	class AFSDPlayerState* GetFSDPlayerState();
	class AItem* GetEquippedItem();
	float GetBaseResolutionScale();
	void BP_OnRefresh();
};


// Class FSD.ActorTrackingWidget
// 0x0028 (0x0250 - 0x0228)
class UActorTrackingWidget : public UFSDUserWidget
{
public:
	TWeakObjectPtr<class USceneComponent>              TargetComponent;                                          // 0x0228(0x0008) (CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	float                                              WorldHeightOffset;                                        // 0x0230(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              ScaleBy;                                                  // 0x0234(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FMargin                                     ScreenMargin;                                             // 0x0238(0x0010) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                WidgetZOrder;                                             // 0x0248(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x024C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.ActorTrackingWidget");
		return ptr;
	}


	void SetTargetComponent(class USceneComponent* Component);
	void SetTarget(class AActor* Actor);
	void OnTargetSet(class AActor* NewTarget);
	void OnTargetDistanceChanged(float distance);
	void OnShow();
	void OnInViewChanged(bool inView, float Angle);
	class AActor* GetTarget();
	struct FVector2D GetRenderTranslation();
	static bool FindScreenPosition(class APlayerController* PlayerController, const struct FVector& WorldLocation, const struct FMargin& Margin, struct FVector* ScreenCord, float* Angle);
	static class UActorTrackingWidget* CreateTrackingWidget(class APlayerController* PlayerController, class UClass* WidgetType, class USceneComponent* TargetComponent);
};


// Class FSD.ActorTrackingComponent
// 0x0010 (0x0250 - 0x0240)
class UActorTrackingComponent : public USceneComponent
{
public:
	bool                                               VisibleOnHoldTAB;                                         // 0x0240(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               VisibleFromStart;                                         // 0x0241(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0242(0x0002) MISSED OFFSET
	TWeakObjectPtr<class UActorTrackingWidget>         Widget;                                                   // 0x0244(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x024C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.ActorTrackingComponent");
		return ptr;
	}


	void ToggleIcon(bool Visible);
	void OnHoldTAB(bool IsDown);
	bool IsIconVisible();
};


// Class FSD.AdicPuddle
// 0x0028 (0x0350 - 0x0328)
class AAdicPuddle : public AActor
{
public:
	TWeakObjectPtr<class UPrimitiveComponent>          Collider;                                                 // 0x0328(0x0008) (CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	class USoundBase*                                  SpawnSound;                                               // 0x0330(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	class UClass*                                      InflictedStatusEffect;                                    // 0x0338(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0340(0x0008) MISSED OFFSET
	float                                              LifeTime;                                                 // 0x0348(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x034C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.AdicPuddle");
		return ptr;
	}


	void OnEndOverLap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex);
	void OnBeginOverLap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
};


// Class FSD.AfflictionEffect
// 0x0000 (0x0028 - 0x0028)
class UAfflictionEffect : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.AfflictionEffect");
		return ptr;
	}


	bool ShouldInstantiate();
	void ReceiveEndEffect(class UPawnAfflictionComponent* Target);
	void ReceiveBeginEffect(class UPawnAfflictionComponent* Target);
};


// Class FSD.PawnFrozenUniqueAfflictionEffect
// 0x0000 (0x0028 - 0x0028)
class UPawnFrozenUniqueAfflictionEffect : public UAfflictionEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.PawnFrozenUniqueAfflictionEffect");
		return ptr;
	}

};


// Class FSD.PawnBurningUniqueAfflictionEffect
// 0x0000 (0x0028 - 0x0028)
class UPawnBurningUniqueAfflictionEffect : public UAfflictionEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.PawnBurningUniqueAfflictionEffect");
		return ptr;
	}

};


// Class FSD.AttachedParticlesAfflictionEffect
// 0x0020 (0x0048 - 0x0028)
class UAttachedParticlesAfflictionEffect : public UAfflictionEffect
{
public:
	class UParticleSystem*                             ParticleEffect;                                           // 0x0028(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	EAfflictionSocket                                  Socket;                                                   // 0x0030(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
	TArray<class UParticleSystemComponent*>            EmitterInstances;                                         // 0x0038(0x0010) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.AttachedParticlesAfflictionEffect");
		return ptr;
	}

};


// Class FSD.CharacterShoutAfflictionEffect
// 0x0008 (0x0030 - 0x0028)
class UCharacterShoutAfflictionEffect : public UAfflictionEffect
{
public:
	class UDialogDataAsset*                            Shout;                                                    // 0x0028(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.CharacterShoutAfflictionEffect");
		return ptr;
	}

};


// Class FSD.SoundAfflictionEffect
// 0x0020 (0x0048 - 0x0028)
class USoundAfflictionEffect : public UAfflictionEffect
{
public:
	class USoundCue*                                   BeginSound;                                               // 0x0028(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class USoundCue*                                   EndSound;                                                 // 0x0030(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               Attach;                                                   // 0x0038(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0039(0x0007) MISSED OFFSET
	struct FName                                       AttachBone;                                               // 0x0040(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.SoundAfflictionEffect");
		return ptr;
	}

};


// Class FSD.AttachMeshesAfflictionEffect
// 0x0018 (0x0040 - 0x0028)
class UAttachMeshesAfflictionEffect : public UAfflictionEffect
{
public:
	TArray<struct FAttachMeshesAfflictionItem>         AttachItems;                                              // 0x0028(0x0010) (CPF_Edit, CPF_ZeroConstructor)
	class UParticleSystem*                             OnRemoveEffect;                                           // 0x0038(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.AttachMeshesAfflictionEffect");
		return ptr;
	}

};


// Class FSD.FrozenAfflictionEffect
// 0x0030 (0x0058 - 0x0028)
class UFrozenAfflictionEffect : public UAfflictionEffect
{
public:
	TArray<struct FFrozenAfflictionItem>               IceParts;                                                 // 0x0028(0x0010) (CPF_Edit, CPF_ZeroConstructor)
	class UMaterialInterface*                          MaterialOverride;                                         // 0x0038(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FName                                       ParticleBone;                                             // 0x0040(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<class UMaterialInterface*>                  IceMaterials;                                             // 0x0048(0x0010) (CPF_Edit, CPF_ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.FrozenAfflictionEffect");
		return ptr;
	}

};


// Class FSD.BurningAfflictionEffect
// 0x0008 (0x0030 - 0x0028)
class UBurningAfflictionEffect : public UAfflictionEffect
{
public:
	EFrozenBitsSize                                    FireParticleSize;                                         // 0x0028(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.BurningAfflictionEffect");
		return ptr;
	}

};


// Class FSD.BoneParticlesAfflictionEffect
// 0x0018 (0x0040 - 0x0028)
class UBoneParticlesAfflictionEffect : public UAfflictionEffect
{
public:
	TArray<class UParticleSystem*>                     Particles;                                                // 0x0028(0x0010) (CPF_Edit, CPF_EditFixedSize, CPF_ZeroConstructor)
	class USoundCue*                                   Sound;                                                    // 0x0038(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.BoneParticlesAfflictionEffect");
		return ptr;
	}

};


// Class FSD.FSDPawn
// 0x0018 (0x03A0 - 0x0388)
class AFSDPawn : public APawn
{
public:
	class UStatusEffectsComponent*                     StatusEffects;                                            // 0x0388(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	class UEnemyTemperatureComponent*                  Temperature;                                              // 0x0390(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	bool                                               IsFrozen;                                                 // 0x0398(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	bool                                               CanFlee;                                                  // 0x0399(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               IsFleeing;                                                // 0x039A(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x039B(0x0005) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.FSDPawn");
		return ptr;
	}


	void UnFreeze();
	void StopFleeing();
	void StartFleeing(const struct FVector& fromLocation);
	void SetAlerted(bool isAlerted);
	void OnUnFrozen();
	void OnStoppedFleeing();
	void OnStartedFleeing();
	void OnRep_IsFrozen();
	void OnFrozen();
	void OnArmorPartsDestroyedFromRadialDamage(TArray<unsigned char> destroyedParts);
	bool GetIsAlerted();
	void Freeze();
	void All_ArmorPartsDestroyed(TArray<unsigned char> parts);
};


// Class FSD.DeepPathfinderCharacter
// 0x0098 (0x0438 - 0x03A0)
class ADeepPathfinderCharacter : public AFSDPawn
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x03A0(0x0018) MISSED OFFSET
	class UDeepPathfinderMovement*                     PathfinderMovement;                                       // 0x03B8(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	class USkeletalMeshComponent*                      Mesh;                                                     // 0x03C0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x03C8(0x0020) (CPF_Edit, CPF_BlueprintVisible)
	struct FName                                       IsAlertedKey;                                             // 0x03E8(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FName                                       CenterMassSocketName;                                     // 0x03F0(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDeepPatherFinderCharacterAfflictionComponent* affliction;                                               // 0x03F8(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	float                                              AnimationOffset;                                          // 0x0400(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	bool                                               CanPlayerStandOn;                                         // 0x0404(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               UseDormancy;                                              // 0x0405(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0406(0x0002) MISSED OFFSET
	float                                              StaggerDurationMultiplier;                                // 0x0408(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               IsHidden;                                                 // 0x040C(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x040D(0x0003) MISSED OFFSET
	float                                              AttackerRadius;                                           // 0x0410(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0414(0x0004) MISSED OFFSET
	TArray<class UMaterialInterface*>                  CachedMaterials;                                          // 0x0418(0x0010) (CPF_ZeroConstructor, CPF_Transient)
	float                                              AllowedInFormationChance;                                 // 0x0428(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData04[0xC];                                       // 0x042C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.DeepPathfinderCharacter");
		return ptr;
	}


	void TryJoinFormation();
	void SetHidden(bool shouldHide);
	void LeaveFormation();
	class UHealthComponentBase* GetHealthComponent();
};


// Class FSD.EnemyDeepPathfinderCharacter
// 0x0020 (0x0458 - 0x0438)
class AEnemyDeepPathfinderCharacter : public ADeepPathfinderCharacter
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0438(0x0008) MISSED OFFSET
	class UEnemyHealthComponent*                       HealthComponent;                                          // 0x0440(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	struct FQueuedMontage                              QueuedMontage;                                            // 0x0448(0x0010) (CPF_Net, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.EnemyDeepPathfinderCharacter");
		return ptr;
	}


	void OnRep_QueuedMontage();
};


// Class FSD.AFlyingBug
// 0x01A0 (0x05F8 - 0x0458)
class AAFlyingBug : public AEnemyDeepPathfinderCharacter
{
public:
	class UDashPoints*                                 DashPointsComponent;                                      // 0x0458(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	class UEnemyComponent*                             EnemyComponent;                                           // 0x0460(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	class UPawnStatsComponent*                         PawnStats;                                                // 0x0468(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	class UOutlineComponent*                           Outline;                                                  // 0x0470(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	class UPawnSensingComponent*                       Senses;                                                   // 0x0478(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	class USphereComponent*                            ExplosionSphere;                                          // 0x0480(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	TArray<class UAnimSequenceBase*>                   HitReactions;                                             // 0x0488(0x0010) (CPF_Edit, CPF_ZeroConstructor)
	struct FScriptMulticastDelegate                    OnStopDash;                                               // 0x0498(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnStartDash;                                              // 0x04A8(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnStartFizzle;                                            // 0x04B8(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	float                                              FirstHitReactBlendIn;                                     // 0x04C8(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              OverrideHitReactBlendIn;                                  // 0x04CC(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               SetLifeTime;                                              // 0x04D0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x04D1(0x0003) MISSED OFFSET
	TWeakObjectPtr<class UAudioComponent>              WingSoundComponent;                                       // 0x04D4(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x04DC(0x0004) MISSED OFFSET
	class USoundBase*                                  WingSound;                                                // 0x04E0(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	bool                                               UsesAttackStance;                                         // 0x04E8(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x04E9(0x0003) MISSED OFFSET
	float                                              AcceptedDashradius;                                       // 0x04EC(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              DashSpeed;                                                // 0x04F0(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x04F4(0x0004) MISSED OFFSET
	struct FRuntimeFloatCurve                          DashSpeedCurve;                                           // 0x04F8(0x0078) (CPF_Edit, CPF_DisableEditOnInstance)
	float                                              ModifiedDashSpeed;                                        // 0x0570(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	float                                              AttackModeRotationSpeed;                                  // 0x0574(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x0578(0x0004) MISSED OFFSET
	bool                                               StopLogicOnDeath;                                         // 0x057C(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x057D(0x0003) MISSED OFFSET
	float                                              SlowdownRadius;                                           // 0x0580(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FVector_NetQuantize                         DashOriginLocation;                                       // 0x0584(0x000C) (CPF_Net, CPF_Transient)
	struct FVector_NetQuantize                         DashLocation;                                             // 0x0590(0x000C) (CPF_Net, CPF_Transient)
	struct FVector_NetQuantize                         RagdollImpact;                                            // 0x059C(0x000C) (CPF_Net, CPF_Transient)
	class AActor*                                      RotateTarget;                                             // 0x05A8(0x0008) (CPF_Net, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	bool                                               LookStraight;                                             // 0x05B0(0x0001) (CPF_Edit, CPF_Net, CPF_ZeroConstructor, CPF_Transient, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	bool                                               IsDashing;                                                // 0x05B1(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	bool                                               AttackStance;                                             // 0x05B2(0x0001) (CPF_Net, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	bool                                               ShouldExposeWeakPoint;                                    // 0x05B3(0x0001) (CPF_Net, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	bool                                               UsingVoiceChatter;                                        // 0x05B4(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x05B5(0x0003) MISSED OFFSET
	float                                              MinChatterDelay;                                          // 0x05B8(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              MaxChatterDelay;                                          // 0x05BC(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              NextChatterTime;                                          // 0x05C0(0x0004) (CPF_Net, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x05C4(0x0004) MISSED OFFSET
	class USoundBase*                                  ChatterSound;                                             // 0x05C8(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	class UEnemyRangedAttack*                          RangedAttack;                                             // 0x05D0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	TWeakObjectPtr<class UAudioComponent>              CurrentChatterComponent;                                  // 0x05D8(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	bool                                               UseDefaultRagdoll;                                        // 0x05E0(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData08[0x7];                                       // 0x05E1(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnAlertNearbyEnemies;                                     // 0x05E8(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.AFlyingBug");
		return ptr;
	}


	void StopDashing();
	void StartDashing();
	void SetExternallyControlled(bool isExternallyControlled);
	void SetDashLocation(const struct FVector& newDashLocation);
	void SetAttackStance(bool isAttackStance);
	void OnRep_RagdollImpact();
	void OnRep_DashLocation();
	void OnRep_ChatterTime();
	void OnFlyingBugDeath(class UHealthComponentBase* aHealthComponent);
	void OnDamaged(float Amount);
	bool GetValidDashPoint(bool Surround);
	bool GetIsInAttackStance();
	bool GetIsDashing();
	struct FVector GetDashLocation();
	void AlertNearbyEnemies();
};


// Class FSD.EnemyAnimInstance
// 0x0040 (0x03A0 - 0x0360)
class UEnemyAnimInstance : public UAnimInstance
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0360(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnMeleeAttackNotify;                                      // 0x0368(0x0010) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnStopLeadingNotify;                                      // 0x0378(0x0010) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	bool                                               IsAlive;                                                  // 0x0388(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0389(0x0003) MISSED OFFSET
	float                                              RandomStartPosition;                                      // 0x038C(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	class UHealthComponentBase*                        HealthComponent;                                          // 0x0390(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0398(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.EnemyAnimInstance");
		return ptr;
	}


	bool IsSlotPlayingAnyAnimation(const struct FName& SlotNodeName);
	class USkeletalMeshComponent* GetSkeletalMesh();
};


// Class FSD.SimpleMovingEnemyAnimInstance
// 0x0030 (0x03D0 - 0x03A0)
class USimpleMovingEnemyAnimInstance : public UEnemyAnimInstance
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x03A0(0x0008) MISSED OFFSET
	float                                              WalkCycleSpeed;                                           // 0x03A8(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              StartMovingSpeed;                                         // 0x03AC(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              StopMovingSpeed;                                          // 0x03B0(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              WalkCycleMinRate;                                         // 0x03B4(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              WalkCyclePlayRate;                                        // 0x03B8(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	float                                              MeshScale;                                                // 0x03BC(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	bool                                               IsMoving;                                                 // 0x03C0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0xF];                                       // 0x03C1(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.SimpleMovingEnemyAnimInstance");
		return ptr;
	}


	void SetMeshScale(float NewScale);
};


// Class FSD.FlyingBugAnimInstance
// 0x0000 (0x03D0 - 0x03D0)
class UFlyingBugAnimInstance : public USimpleMovingEnemyAnimInstance
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.FlyingBugAnimInstance");
		return ptr;
	}

};


// Class FSD.AIFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAIFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.AIFunctionLibrary");
		return ptr;
	}


	static int MakeEnemiesFleeFromArea(class UObject* WorldContextObject, const struct FVector& Center, float Radius, int maxEnemiesAffected);
	static bool IsEnemyAlertet(class APawn* enemy);
	static class APlayerCharacter* GetPlayerTarget(class AActor* From, float MaxDistance, bool MustBeAlive, bool MustBeUnparalyzed, bool AccountForAttackers, class AActor* ignoreTarget, bool IsFlying);
	static class APlayerCharacter* ConsiderChangingTarget(class APlayerCharacter* CurrentTarget, class AActor* From, float MaxDistance, bool MustBeAlive, bool MustBeUnparalyzed, bool CurrentTargetMustBeAlive, bool IsFlying);
	static void AlertEnemy(class APawn* enemy);
	static void AlertEnemiesInRange(class UObject* WorldContextObject, const struct FVector& Origin, float Range, class APawn* alerter);
};


// Class FSD.AmmoCountWidget
// 0x0020 (0x0228 - 0x0208)
class UAmmoCountWidget : public UUserWidget
{
public:
	class APlayerCharacter*                            Character;                                                // 0x0208(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	class AItem*                                       Item;                                                     // 0x0210(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	class UItemAggregator*                             Aggregator;                                               // 0x0218(0x0008) (CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0220(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.AmmoCountWidget");
		return ptr;
	}


	void OnVisibleChanged(bool Visible, bool showClipCount);
	void OnTotalVisibleChanged(bool Visible);
	void OnTotalChanged(int Total);
	void OnItemTotalChanged(int Value);
	void OnItemEquipped(class AItem* NewItem);
	void OnItemAmountChanged(int Value);
	void OnAmountChanged(int Count);
	void DoItemEquipped();
};


// Class FSD.ItemAggregator
// 0x0018 (0x0108 - 0x00F0)
class UItemAggregator : public UActorComponent
{
public:
	struct FText                                       CounterText;                                              // 0x00F0(0x0018) (CPF_BlueprintVisible, CPF_BlueprintReadOnly)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.ItemAggregator");
		return ptr;
	}


	void UnbindAllEvents();
};


// Class FSD.ClipBasedItemAggregator
// 0x0078 (0x0180 - 0x0108)
class UClipBasedItemAggregator : public UItemAggregator
{
public:
	struct FScriptMulticastDelegate                    OnClipAmountChanged;                                      // 0x0108(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnTotalAmountChanged;                                     // 0x0118(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnClipAndTotalChanged;                                    // 0x0128(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnReloadTimeChanged;                                      // 0x0138(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnReloadComplete;                                         // 0x0148(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnReloadStarted;                                          // 0x0158(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnMaxAmmoCapacityChanged;                                 // 0x0168(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	bool                                               ShowTotalAmount;                                          // 0x0178(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0179(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.ClipBasedItemAggregator");
		return ptr;
	}


	void ReloadStarted();
	void ReloadComplete();
	int GetTotalAmount();
	int GetClipAmount();
};


// Class FSD.AmmoDriveWeaponAggregator
// 0x0008 (0x0188 - 0x0180)
class UAmmoDriveWeaponAggregator : public UClipBasedItemAggregator
{
public:
	class AAmmoDrivenWeapon*                           Weapon;                                                   // 0x0180(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.AmmoDriveWeaponAggregator");
		return ptr;
	}

};


// Class FSD.WeaponTriggerStrategy
// 0x0000 (0x0028 - 0x0028)
class UWeaponTriggerStrategy : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("Class FSD.WeaponTriggerStrategy");
		return ptr;
	}

};


// Class FSD.Item
// 0x00D0 (0x03F8 - 0x0328)
class AItem : public AActor
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0328(0x0028) MISSED OFFSET
	struct FVector                                     FPCameraOffset;                                           // 0x0350(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               EnableDangerousSaveGameIDEditing;                         // 0x035C(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x035D(0x0003) MISSED OFFSET
	struct FGuid                                       SavegameID;                                               // 0x0360(0x0010) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class APlayerCharacter*                            Character;                                                // 0x0370(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	class UUpgradableItemComponent*                    UpgradableItem;                                           // 0x0378(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData)
	class UClass*                                      CameraShake;                                              // 0x0380(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               CameraShakeOnStartUsing;                                  // 0x0388(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               CameraShakeOnEquip;                                       // 0x0389(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData02[0xE];                                       // 0x038A(0x000E) MISSED OFFSET
	class UCurveFloat*                                 HeatCurve;                                                // 0x0398(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              CooldownRate;                                             // 0x03A0(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              UnjamDuration;                                            // 0x03A4(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              CurrentTemperature;                                       // 0x03A8(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x03AC(0x0004) MISSED OFFSET
	class USoundBase*                                  AudioTemperature;                                         // 0x03B0(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FName                                       TemperatureFloatParam;                                    // 0x03B8(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAudioComponent*                             TemperatureAudioComponent;                                // 0x03C0(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	bool                                               Overheated;                                               // 0x03C8(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x03C9(0x0007) MISSED OFFSET
	class UDialogDataAsset*                            ShoutOverheated;                                          // 0x03D0(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
