#pragma once

// Deep Rock Galactic (0.22) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "DRG_ABP_TP_Dwarf_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_TP_Dwarf.ABP_TP_Dwarf_C
// 0x5258 (0x56E8 - 0x0490)
class UABP_TP_Dwarf_C : public UPlayerTPAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0490(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_D1C3D60A443436049FF162BBEB48845D;      // 0x0498(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54AC03914929D312684A7AB40ADDD3A9;// 0x04D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9B390A5345C30EDEB6FCF09363288162;// 0x0520(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54404F9441A50012F9C80CAB71BB5663;// 0x0568(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FB12C11242ECE19F7F9F62A797F56D5C;// 0x05B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5F8EC4874F79314E97A1078A949933D3;// 0x05F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_410E884A4DD8165328A51480E66B41EF;// 0x0640(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7EB0EC6D4A605D5517A46B94F4DA7FE0;// 0x0688(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_53BB2C794E589DC84B6D1CB75A5CB420;// 0x06D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FFF8D04A437F153ADB98EBAD9DA15F3B;// 0x0718(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_719288E14A030A92C2F38FB9A4B03021;// 0x0760(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D4665C73480BD5092970C8ACAF85CE8E;// 0x07A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2595A9A74D5B5AAFB6972B840FF96AFE;// 0x07F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8CBB7E4C4EE333095FAA01AF0E1E04D7;// 0x0838(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9E12FAF14AAEDB6933BF6981057847DA;// 0x0880(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_92859DB047A6C21B87F322ADA28D49FB;// 0x08C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AED3CF1540DFD0684D18689AC3688CAE;// 0x0910(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B7C68CFC46C6C575ABDAADB4A8C8E599;// 0x0958(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1A83FD9245F6B87A9CB48D95F4B4789A;// 0x09F8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_53970147420878D699A89AA21A56CAE9;// 0x0A38(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_358B6EB744BAFBB3CC1FFAB10ABCD393;// 0x0AD8(0x0040)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_9EA98E214A688667C5EC669193C64A64;// 0x0B18(0x0070)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D47953EB4795FF89C0984BAD9D3025B9;// 0x0B88(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DE17F8D346925DF71481AA8DA2292E2C;// 0x0BC8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_831DD7F1402E7AA40400568FD7C241CE;// 0x0C68(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F04954FD48BE2A9BA81DCA817A41B845;// 0x0CA8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C0325CF6488CBCE6D953099BD705F589;// 0x0D48(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_23AE27A44B2C2ECC6FF33FA3A0C76158;// 0x0D88(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D76F324E4A821AFBCB218C8A9D338615;// 0x0E28(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_710EF992422479E0647ECA8CF24EAEDD;// 0x0E68(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A3A6D26749FAABC537EEEB9616D87FC4;// 0x0F08(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0244E37E45B2C053C6D06A96E28E20F0;// 0x0FD8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9436AD96457998D19560DDA01897647A;// 0x1078(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D2D70854C9161720E51BFBFEFDDF891;// 0x10B8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_76E132574AEB7214700F49A70D06CAD2;// 0x1158(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B3F393B2478F619EEF85EFBE4EF0AB6E;// 0x1228(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_BAEF60CF49B6145A0B6A74BEFD620DCC;// 0x12C8(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_AB4A8AA3469D03D23E28859BE9FB1211;// 0x1308(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C8D9DD5B4D78E170A9CD739AF76D0103;// 0x13D8(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_38D28B2F42766CBF818700A1EFAEDEF3;// 0x1478(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_030E33B341E530605C819DAA8780F05F;      // 0x1550(0x0068)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17851D8947BEA6380FCAE28692A7C8D1;// 0x15B8(0x00A0)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_E9020DF54FA1B02F07F2EEA88055557B;// 0x1658(0x0068)
	struct FAnimNode_MakeDynamicAdditive               AnimGraphNode_MakeDynamicAdditive_B4B646394083CEE25AB847AE750598BD;// 0x16C0(0x0058)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87C3A548429BFD8F985F339D1EBEC203;// 0x1718(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_427EF9FD4961E1B3E732CC8B1777981B;// 0x1760(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF1E381E41DF66F74FF821BD304FBD78;// 0x17A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_28334410404703E950E70E8218FC9268;// 0x17F0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_9B7A84534C23FF80F10118BBCA3B7272;// 0x1838(0x0070)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4FAF941A4FEBF35D52F8E3815C9EC2CF;// 0x18A8(0x0040)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_C93272D84226B6AF6884289BD3760266;// 0x18E8(0x0070)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_FCDBA9C94BA401B5DB32D9AB93F98A7E;// 0x1958(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E47BD1C241F140538E58D1A608792B39;// 0x1998(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AE3CE951478D94C9622F73B17D39848F;// 0x1A38(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D2A803A7447B65CB5CF4FD93FBF9C455;// 0x1A78(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2F76EF8744CE476A8690F4B9166C28E5;// 0x1B58(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_B4103D0B4743FAA4EFE350B699CAF1C9;// 0x1BF8(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6B8F0E364855FD21D9327AB45BA66B10;// 0x1C38(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3C036E4E4FC59ED1DD98BCB289DF7670;// 0x1D70(0x0138)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C83D8D964E38FB4006C7B2BDF928108A;// 0x1EA8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4287568E455D6C285BB76991F5ABE729;// 0x1EE8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_65341335413A786604572B878969EA29;// 0x1F88(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BBC0B6EC4991525F17E798A8A0862F48;// 0x2058(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_34098E5F4D73AF452835578971CB8F58;// 0x20F8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C289D9C14254E5C2E8DCE2ABBFC6838F;// 0x2198(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EDB2BA1B493E748E1CD15EACE52ACA8C;// 0x2268(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8A89C95C4BBF2459D9F5FC9D35E8FAF4;// 0x2308(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BFBA54F346F649473E30A5BCF0D366E7;// 0x23A8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D5355959479ECAF7F4512BBCA6E50082;// 0x2478(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2BC0EF7B49DE1B1736CF15906DEEA3BB;// 0x2518(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_740762FA48C11E754031508D46385274;// 0x25B8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C666D601409CDCBB9C417888E868EB73;// 0x2688(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0EF2A70746EA0D5C762865B327E0305C;// 0x2728(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DCCE6636427F977A2C85409D84B25E9F;// 0x27C8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_73F815CD476E83ABA3CA8AAC8FB477BE;// 0x2898(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_85A39D6E49CCFE5E078CD790596D1ACF;// 0x2938(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_830CED7748F94390B5D2489EFF40A1AC;// 0x29D8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_62EAA6E4428542697DFEDA972589DB96;// 0x2AA8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D916F42C4995E0EE57215489566EB6C4;// 0x2B48(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8D6FE4E0405E4B384FC08BB966E72473;// 0x2BE8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D96792C94053E18DFCEFEB82623EC95C;// 0x2CB8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F689A8924A92A8361E46BC81C4F394C5;// 0x2D58(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BFAF124F42B296B4EA67F6A700ECFA14;// 0x2DF8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A90B8024A944CEDB6EC3F91D3A5B10E;// 0x2EC8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E82B08E546EE31866CE59595BAC72764;// 0x2F68(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7DFA0F39444A81B80D65C2859173F8EE;// 0x3008(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CAA1E82D41480650648A33B16A279133;// 0x30D8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_84196D004AE41F440B91638EFB9B8230;// 0x3178(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C2742A01402C89F2864F119684BBC4FD;// 0x3218(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6B6D07074003A39618FCCBB155528084;// 0x32E8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_AE2E21D24A278E9F502B8B83370E57BB;// 0x3388(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B52E114D4CA7492C4C225FB8A4845316;// 0x3458(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FE3D8EF3433C76992D1765A0149C2768;// 0x34F8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_297FD9484DCF5B288EC789894B7E5D9E;// 0x3598(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CB97285040F014CAA36DF3B802ADF9DF;// 0x3668(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CFE72D0A4FFED5B343D94D902A8C81E3;// 0x3738(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F174D9CD4EEDA10286C42CB005C91ECA;// 0x3808(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_91C056664B7AEDD6B3D973A63FB447A9;// 0x38D8(0x00D0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7E5A9315403B2A76B20D97B229A7DD61;// 0x39A8(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_15E50BD6447091EC9247EC9FA4606939;// 0x39E8(0x0138)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D6C0AF2345790983B1D6E1B90BAE62B7;// 0x3B20(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B4FF700C4155DDFA404DB496A65FA7FC;// 0x3B60(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_FF6F95D9431F0126E0A2C69C5306A8F9;// 0x3C30(0x00E0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_638FCF59434838C169B919945620E760;// 0x3D10(0x00C0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_6769F37F4911A9D560BBB8B38BFB72C8;// 0x3DD0(0x00C0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_EA67D3E549F59157F497EFA3BBA5F371;// 0x3E90(0x00C0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_709DC0464C23570942AAB4A99DCA8C6D;// 0x3F50(0x00C0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_08626BA8404623EA94BD69A233FBC28A;// 0x4010(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_AE9B52574CB108E35B61828DE56F47D2;// 0x4050(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_CD634A9742BA1089E8548C9022793074;      // 0x4130(0x0068)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_557660394293ABBD70B6B0AC1D14A85C;// 0x4198(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD0444B0469DF9EF738601A4150620B7;// 0x4268(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_78A117EA408DFC76E157129A241EDDAB;// 0x4308(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_956308CF4FB69B80A6790A9ECFDC6357;// 0x43E0(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_E624F6B7417EBD8D0AFEECB39B126CA1;// 0x4428(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_92E7791E4BD53EE4B4AC31B1C9FF8CA6;      // 0x4500(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_E4DAAE9E4469B923CC7885AE7F0940C0;      // 0x4568(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7E1CD9754B6EE6269E1A71BC02494813;// 0x45D0(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_88FB7C2F4083DA21CA5043826DEA2D3E;// 0x4618(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_9274EEC44E953197531F68BFB6A20D46;      // 0x46F0(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_DBB259244484A3C7658D718358594DD2;      // 0x4758(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3C20F22C4C1A06777C84628008AF5932;// 0x47C0(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_097C4C8448EEEE6AC3EF8882684EF0E4;// 0x4898(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C11DC60E442F8008799D1E804CB44453;// 0x4938(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_886D6DF54F6CD2620C2634B8178AFEE2;// 0x4980(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_82B2D71A46EB983C5254FB8953A7DB10;// 0x4A50(0x0048)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_4035569E48431A867F625091664CDA4C;// 0x4A98(0x01E0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_AAC2AFCD4F4B8644A74CCE8824928BAD;// 0x4C78(0x01E0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_DC3EDD7B42E5AB2D1FB8BF89859DEAE3;// 0x4E58(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_20F7A1BD468661AF9CE040A6EF3B4B02;// 0x4E98(0x0040)
	unsigned char                                      UnknownData00[0x8];                                       // 0x4ED8(0x0008) MISSED OFFSET
	struct FAnimNode_RigidBody                         AnimGraphNode_RigidBody_547984784517490DD1CA93971747E04E; // 0x4EE0(0x0570)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_46453FB144B5BD6CC1214088E77C5359;// 0x5450(0x00C0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_3ED8BCED43829BC2F1B6A6BB29777677;// 0x5510(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2ED98E574844A305A5F33A83C0356480;// 0x5550(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_435EEB64405504F302C583BAF661A98F;// 0x5590(0x0138)
	float                                              StrafeBlendDuration;                                      // 0x56C8(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x56CC(0x0004) MISSED OFFSET
	class ABP_PlayerCharacter_C*                       BPCharacter;                                              // 0x56D0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnTemplate, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	bool                                               LeftFootIKOn;                                             // 0x56D8(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x56D9(0x0003) MISSED OFFSET
	struct FVector                                     LeftFootIKLocation;                                       // 0x56DC(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("AnimBlueprintGeneratedClass ABP_TP_Dwarf.ABP_TP_Dwarf_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_B3F393B2478F619EEF85EFBE4EF0AB6E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_C8D9DD5B4D78E170A9CD739AF76D0103();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_6D2D70854C9161720E51BFBFEFDDF891();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_FE3D8EF3433C76992D1765A0149C2768();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_0244E37E45B2C053C6D06A96E28E20F0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_B52E114D4CA7492C4C225FB8A4845316();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_710EF992422479E0647ECA8CF24EAEDD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_6B6D07074003A39618FCCBB155528084();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_23AE27A44B2C2ECC6FF33FA3A0C76158();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_84196D004AE41F440B91638EFB9B8230();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_DE17F8D346925DF71481AA8DA2292E2C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequenceEvaluator_9EA98E214A688667C5EC669193C64A64();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_CAA1E82D41480650648A33B16A279133();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_E82B08E546EE31866CE59595BAC72764();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_TransitionResult_92859DB047A6C21B87F322ADA28D49FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_9A90B8024A944CEDB6EC3F91D3A5B10E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_TransitionResult_9E12FAF14AAEDB6933BF6981057847DA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_F689A8924A92A8361E46BC81C4F394C5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_TransitionResult_8CBB7E4C4EE333095FAA01AF0E1E04D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_D96792C94053E18DFCEFEB82623EC95C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_D916F42C4995E0EE57215489566EB6C4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_62EAA6E4428542697DFEDA972589DB96();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_85A39D6E49CCFE5E078CD790596D1ACF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_73F815CD476E83ABA3CA8AAC8FB477BE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_TransitionResult_7EB0EC6D4A605D5517A46B94F4DA7FE0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_DD0444B0469DF9EF738601A4150620B7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_RotationOffsetBlendSpace_4035569E48431A867F625091664CDA4C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_RotationOffsetBlendSpace_AAC2AFCD4F4B8644A74CCE8824928BAD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_0EF2A70746EA0D5C762865B327E0305C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_C666D601409CDCBB9C417888E868EB73();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_TransitionResult_5F8EC4874F79314E97A1078A949933D3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_2BC0EF7B49DE1B1736CF15906DEEA3BB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_D5355959479ECAF7F4512BBCA6E50082();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_8A89C95C4BBF2459D9F5FC9D35E8FAF4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_EDB2BA1B493E748E1CD15EACE52ACA8C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_TransitionResult_FB12C11242ECE19F7F9F62A797F56D5C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_34098E5F4D73AF452835578971CB8F58();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_BBC0B6EC4991525F17E798A8A0862F48();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_4287568E455D6C285BB76991F5ABE729();
	void BlueprintInitializeAnimation();
	void AnimNotify_StartBuild();
	void AnimNotify_EndBuild();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_SequencePlayer_2F76EF8744CE476A8690F4B9166C28E5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_TransitionResult_9B390A5345C30EDEB6FCF09363288162();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_LayeredBoneBlend_38D28B2F42766CBF818700A1EFAEDEF3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TP_Dwarf_AnimGraphNode_TransitionResult_54AC03914929D312684A7AB40ADDD3A9();
	void ExecuteUbergraph_ABP_TP_Dwarf(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
