#pragma once

// Deep Rock Galactic (0.22) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "DRG_Basic.hpp"
#include "DRG_FSD_enums.hpp"
#include "DRG_AIModule_classes.hpp"
#include "DRG_Engine_classes.hpp"
#include "DRG_CoreUObject_classes.hpp"
#include "DRG_UMG_classes.hpp"
#include "DRG_SlateCore_classes.hpp"
#include "DRG_Slate_classes.hpp"
#include "DRG_GameplayTags_classes.hpp"
#include "DRG_OnlineSubsystemUtils_classes.hpp"
#include "DRG_InputCore_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct FSD.MissionShouts
// 0x0020
struct FMissionShouts
{
	class UDialogDataAsset*                            AfterDropPodExit;                                         // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            OnExitPodDescending;                                      // 0x0008(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            OnExitPodArrived;                                         // 0x0010(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            OnCompletion;                                             // 0x0018(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.CreditsReward
// 0x0020
struct FCreditsReward
{
	struct FText                                       Description;                                              // 0x0000(0x0018) (CPF_Edit, CPF_BlueprintVisible)
	int                                                Amount;                                                   // 0x0018(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct FSD.HeroInfo
// 0x0080
struct FHeroInfo
{
	struct FString                                     HeroAnalyticsID;                                          // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor)
	struct FText                                       HeroName;                                                 // 0x0010(0x0018) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly)
	class UTexture2D*                                  HeroIcon;                                                 // 0x0028(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UTexture2D*                                  SmallHeroIcon;                                            // 0x0030(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UTexture2D*                                  HeroFullSizeImage;                                        // 0x0038(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FLinearColor                                HeroColor;                                                // 0x0040(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FText                                       HeroShortDescription;                                     // 0x0050(0x0018) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly)
	struct FText                                       HeroLongDescription;                                      // 0x0068(0x0018) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly)
};

// ScriptStruct FSD.AttachMeshesAfflictionItem
// 0x0018
struct FAttachMeshesAfflictionItem
{
	struct FName                                       BoneName;                                                 // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              Scale;                                                    // 0x0008(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	class UStaticMesh*                                 Mesh;                                                     // 0x0010(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.RandRange
// 0x0008
struct FRandRange
{
	float                                              Min;                                                      // 0x0000(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              Max;                                                      // 0x0004(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.FrozenAfflictionItem
// 0x0018
struct FFrozenAfflictionItem
{
	struct FName                                       BoneName;                                                 // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FRandRange                                  MeshScale;                                                // 0x0008(0x0008) (CPF_Edit)
	EFrozenBitsSize                                    FrozenBitsSize;                                           // 0x0010(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	float                                              ChanceToSpawn;                                            // 0x0014(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.QueuedMontage
// 0x0010
struct FQueuedMontage
{
	class UAnimMontage*                                Montage;                                                  // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	bool                                               ForceUpdate;                                              // 0x0008(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
};

// ScriptStruct FSD.ItemAnimationItem
// 0x0018
struct FItemAnimationItem
{
	class UAnimMontage*                                FP_CharacterMontage;                                      // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimMontage*                                TP_CharacterMontage;                                      // 0x0008(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimMontage*                                ItemMontage;                                              // 0x0010(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.RecoilSettings
// 0x0028
struct FRecoilSettings
{
	struct FRandRange                                  RecoilRoll;                                               // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly)
	struct FRandRange                                  RecoilPitch;                                              // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly)
	struct FRandRange                                  RecoilYaw;                                                // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly)
	bool                                               CanRecoilDown;                                            // 0x0018(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
	float                                              SpringStiffness;                                          // 0x001C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              CriticalDampening;                                        // 0x0020(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              Mass;                                                     // 0x0024(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.DestructableBodypartItem
// 0x0010
struct FDestructableBodypartItem
{
	TArray<struct FName>                               ArmorBones;                                               // 0x0000(0x0010) (CPF_Edit, CPF_ZeroConstructor)
};

// ScriptStruct FSD.ArmorHealthSubItem
// 0x0020
struct FArmorHealthSubItem
{
	float                                              Health;                                                   // 0x0000(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FName                                       BoneName;                                                 // 0x0008(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<struct FName>                               AdditionalBones;                                          // 0x0010(0x0010) (CPF_Edit, CPF_ZeroConstructor)
};

// ScriptStruct FSD.ArmorHealthItem
// 0x0010
struct FArmorHealthItem
{
	TArray<struct FArmorHealthSubItem>                 ArmorBones;                                               // 0x0000(0x0010) (CPF_Edit, CPF_ZeroConstructor)
};

// ScriptStruct FSD.AttackerInfo
// 0x0010
struct FAttackerInfo
{
	TWeakObjectPtr<class AActor>                       Attacker;                                                 // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	int                                                PositionIndex;                                            // 0x0008(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	float                                              AttackerRadius;                                           // 0x000C(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
};

// ScriptStruct FSD.AutoMinerDamageItem
// 0x0030
struct FAutoMinerDamageItem
{
	TWeakObjectPtr<class UPrimitiveComponent>          Target;                                                   // 0x0000(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	struct FVector_NetQuantize                         Location;                                                 // 0x0008(0x000C) (CPF_Transient)
	struct FVector_NetQuantizeNormal                   Normal;                                                   // 0x0014(0x000C) (CPF_Transient)
	class UFSDPhysicalMaterial*                        Material;                                                 // 0x0020(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      BoneIndex;                                                // 0x0028(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct FSD.BiomeDebrisInfluencerVariant
// 0x0010
struct FBiomeDebrisInfluencerVariant
{
	class UCaveInfluencer*                             Influencer;                                               // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RandomWeight;                                             // 0x0008(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct FSD.BiomeNoiseItem
// 0x0038
struct FBiomeNoiseItem
{
	class UFloodFillSettings*                          CeilingNoise;                                             // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDetailNoise*                                CeilingDetailNoise;                                       // 0x0008(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UFloodFillSettings*                          WallNoise;                                                // 0x0010(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDetailNoise*                                WallDetailNoise;                                          // 0x0018(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UFloodFillSettings*                          FloorNoise;                                               // 0x0020(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDetailNoise*                                FloorDetailNoise;                                         // 0x0028(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              Weight;                                                   // 0x0030(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct FSD.RandFloatIntervalItem
// 0x000C
struct FRandFloatIntervalItem
{
	float                                              Weight;                                                   // 0x0000(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FRandRange                                  Range;                                                    // 0x0004(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly)
};

// ScriptStruct FSD.RandFloatInterval
// 0x0010
struct FRandFloatInterval
{
	TArray<struct FRandFloatIntervalItem>              Intervals;                                                // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor)
};

// ScriptStruct FSD.ResourceSpawner
// 0x0018
struct FResourceSpawner
{
	class UResourceData*                               Resource;                                                 // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FRandFloatInterval                          AmountToSpawn;                                            // 0x0008(0x0010) (CPF_Edit)
};

// ScriptStruct FSD.RequiredMissionItem
// 0x0018
struct FRequiredMissionItem
{
	class UMissionTemplate*                            MissionTemplate;                                          // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UMissionComplexity*                          Complexity;                                               // 0x0008(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UMissionDuration*                            Duration;                                                 // 0x0010(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.VeinResource
// 0x0028
struct FVeinResource
{
	class UVeinResourceCreator*                        ResourceCreator;                                          // 0x0000(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	float                                              VeinLengthToGenerate;                                     // 0x0008(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x1C];                                      // 0x000C(0x001C) MISSED OFFSET
};

// ScriptStruct FSD.CarvedResource
// 0x0010
struct FCarvedResource
{
	class UCarvedResourceCreator*                      ResourceCreator;                                          // 0x0000(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	int                                                Amount;                                                   // 0x0008(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	float                                              Overflow;                                                 // 0x000C(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
};

// ScriptStruct FSD.GemResourceAmount
// 0x0010
struct FGemResourceAmount
{
	class UGemResourceCreator*                         GemCreator;                                               // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	int                                                Amount;                                                   // 0x0008(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct FSD.CollectableSpawnableItem
// 0x0010
struct FCollectableSpawnableItem
{
	class UCollectableResourceData*                    Resource;                                                 // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	int                                                Amount;                                                   // 0x0008(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct FSD.RoomNodeBase
// 0x0001
struct FRoomNodeBase
{
	unsigned char                                      UnknownData00[0x1];                                       // 0x0000(0x0001) MISSED OFFSET
};

// ScriptStruct FSD.RoomEntrance
// 0x0020
struct FRoomEntrance
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	struct FVector                                     Direction;                                                // 0x000C(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	bool                                               IsBLocked;                                                // 0x0018(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	ECaveEntranceType                                  EntranceType;                                             // 0x0019(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x001A(0x0002) MISSED OFFSET
	int                                                PathObstacleID;                                           // 0x001C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
};

// ScriptStruct FSD.RoomLinePoint
// 0x0030
struct FRoomLinePoint
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              HRange;                                                   // 0x000C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              VRange;                                                   // 0x0010(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              CielingNoiseRange;                                        // 0x0014(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              WallNoiseRange;                                           // 0x0018(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              FloorNoiseRange;                                          // 0x001C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              Cielingheight;                                            // 0x0020(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              HeightScale;                                              // 0x0024(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              FloorDepth;                                               // 0x0028(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              FloorAngle;                                               // 0x002C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.RoomLine
// 0x0038
struct FRoomLine
{
	class UFloodFillSettings*                          WallNoiseOverride;                                        // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	class UFloodFillSettings*                          CeilingNoiseOverride;                                     // 0x0008(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	class UFloodFillSettings*                          FloorNoiseOverride;                                       // 0x0010(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	TArray<struct FRoomLinePoint>                      Points;                                                   // 0x0018(0x0010) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst)
	TArray<struct FVector>                             RightVectors;                                             // 0x0028(0x0010) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst)
};

// ScriptStruct FSD.WeightedLinePoint
// 0x001C
struct FWeightedLinePoint
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              Range;                                                    // 0x000C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              NoiseRange;                                               // 0x0010(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              SkewFactor;                                               // 0x0014(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              FillAmount;                                               // 0x0018(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.Pillar
// 0x0020
struct FPillar
{
	class UFloodFillSettings*                          NoiseOverride;                                            // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	TArray<struct FWeightedLinePoint>                  Points;                                                   // 0x0008(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst)
	float                                              NoiseScale;                                               // 0x0018(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	float                                              EndcapScale;                                              // 0x001C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
};

// ScriptStruct FSD.Rotator_NoQuantize
// 0x0000 (0x000C - 0x000C)
struct FRotator_NoQuantize : public FRotator
{

};

// ScriptStruct FSD.RoomBox
// 0x0030
struct FRoomBox
{
	struct FVector                                     Position;                                                 // 0x0000(0x000C) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	struct FRotator_NoQuantize                         Rotation;                                                 // 0x000C(0x000C) (CPF_Edit, CPF_EditConst)
	struct FVector                                     Extends;                                                  // 0x0018(0x000C) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	float                                              NoiseRange;                                               // 0x0024(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	class UFloodFillSettings*                          Noise;                                                    // 0x0028(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
};

// ScriptStruct FSD.RoomItem
// 0x0040
struct FRoomItem
{
	class UClass*                                      Spawnable;                                                // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x0008(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	struct FVector                                     AdjustmentDirection;                                      // 0x0014(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	EItemAdjustmentType                                Adjustment;                                               // 0x0020(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0021(0x0003) MISSED OFFSET
	struct FVector                                     Scale;                                                    // 0x0024(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	struct FRotator_NoQuantize                         Rotation;                                                 // 0x0030(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_EditConst)
	unsigned char                                      UnknownData01[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct FSD.GeneratedRoom
// 0x0068
struct FGeneratedRoom
{
	class UTerrainMaterial*                            Material;                                                 // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	TArray<struct FRoomLine>                           Lines;                                                    // 0x0008(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst)
	TArray<struct FPillar>                             Pillars;                                                  // 0x0018(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst)
	TArray<struct FRoomBox>                            BoxCarvers;                                               // 0x0028(0x0010) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst)
	TArray<struct FRoomBox>                            BoxFillers;                                               // 0x0038(0x0010) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst)
	TArray<struct FRoomEntrance>                       Entrances;                                                // 0x0048(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst)
	TArray<struct FRoomItem>                           RoomItems;                                                // 0x0058(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst)
};

// ScriptStruct FSD.RoomGeneratorItem
// 0x0018
struct FRoomGeneratorItem
{
	class URoomGeneratorBase*                          RoomGenerator;                                            // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	struct FVector                                     Position;                                                 // 0x0008(0x000C) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	float                                              Rotation;                                                 // 0x0014(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
};

// ScriptStruct FSD.RoomNode
// 0x00D7 (0x00D8 - 0x0001)
struct FRoomNode : public FRoomNodeBase
{
	int                                                ID;                                                       // 0x0000(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient, CPF_EditConst, CPF_IsPlainOldData)
	ERoomType                                          RoomType;                                                 // 0x0004(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient, CPF_EditConst, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	struct FVector                                     Position;                                                 // 0x0008(0x000C) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	float                                              Radius;                                                   // 0x0014(0x0004) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	TArray<int>                                        EntranceIDs;                                              // 0x0018(0x0010) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient)
	TArray<int>                                        ExitIDs;                                                  // 0x0028(0x0010) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient)
	TArray<struct FRoomEntrance>                       RoomEntrances;                                            // 0x0038(0x0010) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient)
	bool                                               CanHaveEnemies;                                           // 0x0048(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
	TArray<struct FGeneratedRoom>                      Rooms;                                                    // 0x0050(0x0010) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient)
	float                                              ResourceMultiplier;                                       // 0x0060(0x0004) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	float                                              WeightedResourceAmount;                                   // 0x0064(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	TArray<struct FRoomGeneratorItem>                  RoomGenerators;                                           // 0x0068(0x0010) (CPF_ZeroConstructor, CPF_Transient)
	unsigned char                                      UnknownData02[0x60];                                      // 0x0078(0x0060) MISSED OFFSET
};

// ScriptStruct FSD.TunnelPath
// 0x0010
struct FTunnelPath
{
	TArray<struct FVector>                             Path;                                                     // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_EditConst)
};

// ScriptStruct FSD.TunnelNode
// 0x00BF (0x00C0 - 0x0001)
struct FTunnelNode : public FRoomNodeBase
{
	int                                                EntranceRoomID;                                           // 0x0000(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	int                                                ExitRoomID;                                               // 0x0004(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	struct FRoomEntrance                               Entrance;                                                 // 0x0008(0x0020) (CPF_Edit, CPF_BlueprintVisible, CPF_EditConst)
	struct FRoomEntrance                               Exit;                                                     // 0x0028(0x0020) (CPF_Edit, CPF_BlueprintVisible, CPF_EditConst)
	struct FTunnelPath                                 Path;                                                     // 0x0048(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_Transient, CPF_EditConst)
	int                                                ID;                                                       // 0x0058(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	float                                              WeightedResourceAmount;                                   // 0x005C(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x60];                                      // 0x0060(0x0060) MISSED OFFSET
};

// ScriptStruct FSD.CaveInfluence
// 0x0010
struct FCaveInfluence
{
	struct FVector                                     Center;                                                   // 0x0000(0x000C) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	float                                              Range;                                                    // 0x000C(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
};

// ScriptStruct FSD.GeneratedInfluenceSet
// 0x0020
struct FGeneratedInfluenceSet
{
	class UObject*                                     CaveInfluencer;                                           // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	int                                                NetworkID;                                                // 0x0008(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	TArray<struct FCaveInfluence>                      CaveInfluences;                                           // 0x0010(0x0010) (CPF_ZeroConstructor, CPF_Transient)
};

// ScriptStruct FSD.GeneratedInfluenceSets
// 0x0018
struct FGeneratedInfluenceSets
{
	TArray<struct FGeneratedInfluenceSet>              InfluenceSets;                                            // 0x0000(0x0010) (CPF_ZeroConstructor, CPF_Transient)
	bool                                               IsValid;                                                  // 0x0010(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
};

// ScriptStruct FSD.GeneratedInstantCarver
// 0x0020
struct FGeneratedInstantCarver
{
	class UClass*                                      Carver;                                                   // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x0008(0x000C) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RotationPitch;                                            // 0x0014(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RotationYaw;                                              // 0x0018(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RotationRoll;                                             // 0x001C(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.GeneratedInstantCarverLists
// 0x0010
struct FGeneratedInstantCarverLists
{
	TArray<struct FGeneratedInstantCarver>             Carvers;                                                  // 0x0000(0x0010) (CPF_ZeroConstructor)
};

// ScriptStruct FSD.MatrixWithExactSync
// 0x0040
struct FMatrixWithExactSync
{
	float                                              Values[0x10];                                             // 0x0000(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.LevelGenerationCarver
// 0x0068
struct FLevelGenerationCarver
{
	struct FMatrixWithExactSync                        Transform;                                                // 0x0000(0x0040)
	class USTLMeshCarver*                              MeshCarver;                                               // 0x0040(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UStaticMesh*                                 ConvexCarver;                                             // 0x0048(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              ConvexExpensiveNoise;                                     // 0x0050(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	ECarveOptionsCellSize                              CarveCellSize;                                            // 0x0054(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
	class UTerrainMaterial*                            TerrainMaterial;                                          // 0x0058(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	ECarveFilterType                                   Filter;                                                   // 0x0060(0x0001) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0061(0x0007) MISSED OFFSET
};

// ScriptStruct FSD.LevelGenerationCarverLists
// 0x0010
struct FLevelGenerationCarverLists
{
	TArray<struct FLevelGenerationCarver>              Carvers;                                                  // 0x0000(0x0010) (CPF_ZeroConstructor)
};

// ScriptStruct FSD.GeneratedInstantCarvers
// 0x0028
struct FGeneratedInstantCarvers
{
	TArray<struct FGeneratedInstantCarverLists>        Carvers;                                                  // 0x0000(0x0010) (CPF_ZeroConstructor, CPF_Transient)
	TArray<struct FLevelGenerationCarverLists>         levelCarvers;                                             // 0x0010(0x0010) (CPF_ZeroConstructor, CPF_Transient)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0020(0x0008) MISSED OFFSET
};

// ScriptStruct FSD.PathObstacle
// 0x0010
struct FPathObstacle
{
	struct FVector                                     Position;                                                 // 0x0000(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              Radius;                                                   // 0x000C(0x0004) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.CaveInfluenceSet
// 0x0010
struct FCaveInfluenceSet
{
	TArray<struct FCaveInfluence>                      CaveInfluences;                                           // 0x0000(0x0010) (CPF_ZeroConstructor, CPF_Transient)
};

// ScriptStruct FSD.InfluenceMap
// 0x0050
struct FInfluenceMap
{
	TMap<class UObject*, struct FCaveInfluenceSet>     CaveInfluences;                                           // 0x0000(0x0050) (CPF_ZeroConstructor, CPF_Transient)
};

// ScriptStruct FSD.DebrisCapsule
// 0x001C
struct FDebrisCapsule
{
	struct FVector                                     Start;                                                    // 0x0000(0x000C) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	struct FVector                                     End;                                                      // 0x000C(0x000C) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	float                                              Radius;                                                   // 0x0018(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
};

// ScriptStruct FSD.EdgeType
// 0x0018
struct FEdgeType
{
	float                                              MinLength;                                                // 0x0000(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              MaxLength;                                                // 0x0004(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               Abstract;                                                 // 0x0008(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	struct FName                                       Name;                                                     // 0x0010(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.NodeType
// 0x0010
struct FNodeType
{
	float                                              Radius;                                                   // 0x0000(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               Abstract;                                                 // 0x0004(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	struct FName                                       Name;                                                     // 0x0008(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.EdgeFilterEditor
// 0x0030
struct FEdgeFilterEditor
{
	class ADeepGraphEdge*                              SpecificType;                                             // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<struct FString>                             RequiredFlags;                                            // 0x0008(0x0010) (CPF_Edit, CPF_ZeroConstructor)
	TArray<struct FString>                             DiscardFlags;                                             // 0x0018(0x0010) (CPF_Edit, CPF_ZeroConstructor)
	float                                              MinLength;                                                // 0x0028(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              MaxLength;                                                // 0x002C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.NodeFilterEditor
// 0x0028
struct FNodeFilterEditor
{
	class ADeepGraphNode*                              SpecificType;                                             // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<struct FString>                             RequiredFlags;                                            // 0x0008(0x0010) (CPF_Edit, CPF_ZeroConstructor)
	TArray<struct FString>                             DiscardFlags;                                             // 0x0018(0x0010) (CPF_Edit, CPF_ZeroConstructor)
};

// ScriptStruct FSD.SplitEdgeProdEditor
// 0x0090
struct FSplitEdgeProdEditor
{
	float                                              ProductionPriority;                                       // 0x0000(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FEdgeFilterEditor                           Filter;                                                   // 0x0008(0x0030) (CPF_Edit)
	struct FNodeFilterEditor                           NodeFilters[0x2];                                         // 0x0038(0x0028) (CPF_Edit)
	class ADeepGraphNode*                              NewNode;                                                  // 0x0088(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.PredefinedCharacterMeshData
// 0x0030
struct FPredefinedCharacterMeshData
{
	struct FName                                       SocketName;                                               // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
	class UStaticMesh*                                 Mesh;                                                     // 0x0008(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UStaticMeshComponent*                        MeshInstance;                                             // 0x0010(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData)
	struct FVector                                     PivotOffset;                                              // 0x0018(0x000C) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              Scale;                                                    // 0x0024(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               AddToFirstPerson;                                         // 0x0028(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct FSD.LerpingPercent
// 0x0008
struct FLerpingPercent
{
	unsigned char                                      TargetPercent;                                            // 0x0000(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
};

// ScriptStruct FSD.CountDownFloat
// 0x000C
struct FCountDownFloat
{
	float                                              CountDownDuration;                                        // 0x0000(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0004(0x0008) MISSED OFFSET
};

// ScriptStruct FSD.ProjectileImpact
// 0x0030
struct FProjectileImpact
{
	struct FVector_NetQuantize                         Location;                                                 // 0x0000(0x000C)
	struct FVector_NetQuantizeNormal                   Normal;                                                   // 0x000C(0x000C)
	TWeakObjectPtr<class AActor>                       Actor;                                                    // 0x0018(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UPhysicalMaterial*                           PhysMat;                                                  // 0x0020(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FName                                       BoneName;                                                 // 0x0028(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.UpgradeTier
// 0x0018
struct FUpgradeTier
{
	TArray<class UItemUpgrade*>                        upgrades;                                                 // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor)
	int                                                RequiredCharacterLevel;                                   // 0x0010(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                RequiredPlayerRank;                                       // 0x0014(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.MasteryItem
// 0x0018
struct FMasteryItem
{
	int                                                NeededMastery;                                            // 0x0000(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<class UUnlockReward*>                       Unlocks;                                                  // 0x0008(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor)
};

// ScriptStruct FSD.GearStatEntry
// 0x0068
struct FGearStatEntry
{
	struct FText                                       Text;                                                     // 0x0000(0x0018) (CPF_BlueprintVisible, CPF_Transient)
	struct FText                                       Value;                                                    // 0x0018(0x0018) (CPF_BlueprintVisible, CPF_Transient)
	struct FText                                       BaseValue;                                                // 0x0030(0x0018) (CPF_BlueprintVisible, CPF_Transient)
	struct FText                                       UpgradeValue;                                             // 0x0048(0x0018) (CPF_BlueprintVisible, CPF_Transient)
	EItemPreviewStatus                                 PreviewStatus;                                            // 0x0060(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0061(0x0007) MISSED OFFSET
};

// ScriptStruct FSD.CraftingCost
// 0x0010
struct FCraftingCost
{
	class UResourceData*                               Resource;                                                 // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              Amount;                                                   // 0x0008(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct FSD.CharacterShouts
// 0x00A8
struct FCharacterShouts
{
	class UDialogDataAsset*                            Attention;                                                // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            Follow;                                                   // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            StandingDown;                                             // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            Downed;                                                   // 0x0018(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            RequestRevive;                                            // 0x0020(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            Revived;                                                  // 0x0028(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            Resupply;                                                 // 0x0030(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            FriendlyFire;                                             // 0x0038(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            KillCry;                                                  // 0x0040(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            Dead;                                                     // 0x0048(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            Cheating;                                                 // 0x0050(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            ResourceFull;                                             // 0x0058(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            ResourceFullNoDonkey;                                     // 0x0060(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            CallDonkey;                                               // 0x0068(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            Depositing;                                               // 0x0070(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            DepositingNoDonkey;                                       // 0x0078(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            OutOfAmmo;                                                // 0x0080(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            Reloading;                                                // 0x0088(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            CharacterSelected;                                        // 0x0090(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            UpgradeBought;                                            // 0x0098(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UDialogDataAsset*                            WaitingInDropPod;                                         // 0x00A0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct FSD.DialogStruct
// 0x0030
struct FDialogStruct
{
	bool                                               Enabled;                                                  // 0x0000(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FText                                       Text;                                                     // 0x0008(0x0018) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly)
	class USoundBase*                                  Audio;                                                    // 0x0020(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	EDialogRestriction                                 Restriction;                                              // 0x0028(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct FSD.MixerAnnouncement
// 0x0028
struct FFSD_FMixerAnnouncement
{
	struct FString                                     username;                                                 // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	struct FText                                       Text;                                                     // 0x0010(0x0018) (CPF_Edit, CPF_BlueprintVisible)
};

// ScriptStruct FSD.ActionIconMapping
// 0x0028
struct FActionIconMapping
{
	struct FKey                                        ActionKey;                                                // 0x0000(0x0018) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly)
	class UTexture2D*                                  Icon;                                                     // 0x0018(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	bool                                               DoNotTint;                                                // 0x0020(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
};

// ScriptStruct FSD.DecalData
// 0x0018
struct FDecalData
{
	class UMaterialInterface*                          DecalMaterial;                                            // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              DecalSize;                                                // 0x0008(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              DecalDepth;                                               // 0x000C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              LifeSpan;                                                 // 0x0010(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
